08-motorbike/motorBike-2-nucleos/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  9
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      binary;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

5
(
    frontAndBack
    {
        type            patch;
        nFaces          320;
        startFace       3456;
    }
    inlet
    {
        type            patch;
        nFaces          64;
        startFace       3776;
    }
    outlet
    {
        type            patch;
        nFaces          64;
        startFace       3840;
    }
    lowerWall
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          160;
        startFace       3904;
    }
    upperWall
    {
        type            patch;
        nFaces          160;
        startFace       4064;
    }
)

// ************************************************************************* //
